Repository: nonZero/Hagadot
Catalog: audio/locale/*/LC_MESSAGES/django.po
Languages: he

source: archive.org item details url ( https://archive.org/details/... )
he: כתובת הפריט ב-archive.org (במבנה: https://archive.org/details/... )

source: title
he: כותרת

source: audio url
he: כתובת (URL) לקובץ האודיו

source: length
he: אורך

source: in seconds
he: בשניות

source: summary
he: תקציר

source: NLI document ID
he: מזהה פריט בקטלוג הספריה הלאומית

source: track
he: רצועת אודיו

source: tracks
he: רצועות אודיו

source: Audio
he: אודיו

source: Edit
he: עריכה

source: Edit Bookmarks
he: עריכת סימניות

source: Save
he: שמירה

source: Import new track
he: יבוא רצועת אודיו חדשה

source: Tracks
he: רצועות אודיו

source: can't download info
he: לא ניתן להוריד נתונים

source: Track imported successfully
he: רצועת אודיו חדשה יובאה בהצלחה

source: Track already exists
he: הרצועה כבר קיימת
